app/controllers/favorites_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
INSERT INTO "favorites" ("movie_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["movie_id", 16], ["user_id", 2], ["created_at", "2020-02-09 10:31:58.403668"], ["updated_at", "2020-02-09 10:31:58.403668"]]
---
    def create
      @movie = Movie.find(params[:movie_id])
      @movie.favorites.create!(user: current_user)

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 4]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
    def destroy
			favorite = current_user.favorites.find(params[:id])
			favorite.destroy

			movie = Movie.find(params[:movie_id])