app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (released_on < '2020-02-05 04:28:03.651194') ORDER BY released_on desc
---
  def index
    @movies = Movie.all