app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("stars", "comment", "movie_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["stars", 4], ["comment", "O.k."], ["movie_id", 5], ["created_at", "2020-02-08 07:12:10.345210"], ["updated_at", "2020-02-08 07:12:10.345210"], ["user_id", 4]]
---
  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save