app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$fzoGXijJtEJE3IlYExNbPuev5AtRQue/TbOmBy5j8Ctso8.k7M.3W"], ["updated_at", "2020-02-07 09:27:14.278432"], ["id", 7]]
---
	def update
	  @user = User.find(params[:id])
	  if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def require_correct_user
		@user = User.find(params[:id])